tap "hashicorp/tap"
tap "linuxkit/linuxkit"
tap "valkyrie00/bbrew"
brew "act"
brew "argocd"
brew "atuin"
brew "bash-preexec"
brew "bat"
brew "chezmoi"
brew "cilium-cli"
brew "crane"
brew "direnv"
brew "docker"
brew "docker-compose"
brew "dysk"
brew "eza"
brew "fd"
brew "gcc"
brew "gcc@11", link: false
brew "gemini-cli"
brew "gh"
brew "git-lfs"
brew "glab"
brew "gphoto2"
brew "graphviz"
brew "hcl2json"
brew "helm"
brew "huggingface-cli"
brew "hugo"
brew "k8sgpt"
brew "kubebuilder"
brew "kubernetes-cli"
brew "kubectx"
brew "lima"
brew "mage"
brew "oci-cli"
brew "ollama", restart_service: :changed
brew "openjdk"
brew "ramalama"
brew "ripgrep"
brew "rust"
brew "rustup"
brew "shellcheck"
brew "starship"
brew "stress-ng"
brew "ta-lib"
brew "tealdeer"
brew "television"
brew "topgrade"
brew "trash-cli"
brew "ugrep"
brew "uutils-coreutils"
brew "uv"
brew "virtctl"
brew "xmrig"
brew "youtube-dl"
brew "yq"
brew "yt-dlp"
brew "zoxide"
brew "hashicorp/tap/packer"
brew "linuxkit/linuxkit/linuxkit", args: ["HEAD"]
brew "valkyrie00/bbrew/bbrew"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "george-alisson.html-preview-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "hashicorp.terraform"
vscode "hyunkyunmoon.gzipdecompressor"
vscode "kelvin.vscode-sshfs"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "platformio.platformio-ide"
vscode "redhat.vscode-yaml"
vscode "sanjulaganepola.github-local-actions"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "timonwong.shellcheck"
go "sigs.k8s.io/bom/cmd/bom"
go "golang.org/x/tools/gopls"
go "github.com/konradit/mmt"
go "honnef.co/go/tools/cmd/staticcheck"
flatpak "cc.arduino.IDE2"
flatpak "com.discordapp.Discord"
flatpak "com.feaneron.Boatswain"
flatpak "com.github.rafostar.Clapper"
flatpak "com.github.tchx84.Flatseal"
flatpak "com.github.zocker_160.SyncThingy"
flatpak "com.github.zocker_160.SyncThingy"
flatpak "com.google.Chrome"
flatpak "com.logseq.Logseq"
flatpak "com.mattjakeman.ExtensionManager"
flatpak "com.obsproject.Studio"
flatpak "com.onepassword.OnePassword", remote: "https://downloads.1password.com/linux/flatpak/repo/"
flatpak "com.raggesilver.BlackBox"
flatpak "com.slack.Slack"
flatpak "com.spotify.Client"
flatpak "com.valvesoftware.Steam"
flatpak "com.vysp3r.ProtonPlus"
flatpak "dev.goats.xivlauncher"
flatpak "dev.zed.Zed"
flatpak "io.github.Omniaevo.mqtt5-explorer"
flatpak "io.github.dvlv.boxbuddyrs"
flatpak "io.github.flattool.Warehouse"
flatpak "io.github.kolunmi.Bazaar"
flatpak "io.github.peazip.PeaZip"
flatpak "io.missioncenter.MissionCenter"
flatpak "it.mijorus.gearlever"
flatpak "la.ogri.strongbox"
flatpak "net.davidotek.pupgui2"
flatpak "net.lutris.Lutris"
flatpak "net.sourceforge.Pdfedit"
flatpak "net.supercellwx.app", remote: "app-origin"
flatpak "org.fedoraproject.MediaWriter"
flatpak "org.getmonero.Monero"
flatpak "org.gimp.GIMP"
flatpak "org.gnome.Calculator"
flatpak "org.gnome.Calendar"
flatpak "org.gnome.Characters"
flatpak "org.gnome.Connections"
flatpak "org.gnome.Contacts"
flatpak "org.gnome.DejaDup"
flatpak "org.gnome.DejaDup"
flatpak "org.gnome.Logs"
flatpak "org.gnome.Loupe"
flatpak "org.gnome.Maps"
flatpak "org.gnome.NautilusPreviewer"
flatpak "org.gnome.Papers"
flatpak "org.gnome.SimpleScan"
flatpak "org.gnome.TextEditor"
flatpak "org.gnome.Weather"
flatpak "org.gnome.World.PikaBackup"
flatpak "org.gnome.baobab"
flatpak "org.gnome.clocks"
flatpak "org.gnome.font-viewer"
flatpak "org.gustavoperedo.FontDownloader"
flatpak "org.libreoffice.LibreOffice"
flatpak "org.mozilla.Thunderbird"
flatpak "org.mozilla.firefox"
flatpak "org.pgadmin.pgadmin4"
flatpak "org.raspberrypi.rpi-imager"
flatpak "org.sdrangel.SDRangel"
flatpak "org.shotcut.Shotcut"
flatpak "org.signal.Signal"
flatpak "org.videolan.VLC"
flatpak "us.zoom.Zoom"
flatpak "xyz.z3ntu.razergenie"
