tap "hashicorp/tap"
tap "linuxkit/linuxkit"
brew "act"
brew "argocd"
brew "atuin"
brew "bash-preexec"
brew "bat"
brew "chezmoi"
brew "cilium-cli"
brew "crane"
brew "direnv"
brew "docker"
brew "docker-compose"
brew "dysk"
brew "eza"
brew "fd"
brew "llvm"
brew "gcc"
brew "gcc@11", link: false
brew "gh"
brew "git-lfs"
brew "glab"
brew "gphoto2"
brew "hcl2json"
brew "helm"
brew "huggingface-cli"
brew "hugo"
brew "k8sgpt"
brew "kubebuilder"
brew "kubernetes-cli"
brew "kubectx"
brew "lima"
brew "mage"
brew "oci-cli"
brew "ollama", restart_service: :changed
brew "openjdk"
brew "ramalama"
brew "ripgrep"
brew "rust"
brew "rustup"
brew "shellcheck"
brew "starship"
brew "stress-ng"
brew "ta-lib"
brew "tealdeer"
brew "television"
brew "topgrade"
brew "trash-cli"
brew "ugrep"
brew "uutils-coreutils"
brew "virtctl"
brew "xmrig"
brew "yq"
brew "yt-dlp"
brew "zoxide"
brew "hashicorp/tap/packer"
brew "linuxkit/linuxkit/linuxkit", args: ["HEAD"]
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "hyunkyunmoon.gzipdecompressor"
vscode "kelvin.vscode-sshfs"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "platformio.platformio-ide"
vscode "redhat.vscode-yaml"
vscode "sanjulaganepola.github-local-actions"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "timonwong.shellcheck"
