tap "homebrew/bundle"
tap "homebrew/services"
tap "linuxkit/linuxkit"
brew "argocd"
brew "atuin"
brew "bat"
brew "cilium-cli"
brew "crane"
brew "direnv"
brew "docker"
brew "eza"
brew "fd", link: false
brew "gcc"
brew "gcc@11", link: false
brew "gh"
brew "glab"
brew "helm"
brew "k8sgpt"
brew "kubebuilder"
brew "kubernetes-cli"
brew "kubectx"
brew "lima"
brew "mage"
brew "oci-cli"
brew "ollama", restart_service: :changed
brew "openjdk"
brew "ripgrep"
brew "ugrep"
brew "youtube-dl"
brew "yq"
brew "yt-dlp"
brew "zoxide"
brew "linuxkit/linuxkit/linuxkit", args: ["HEAD"]
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hyunkyunmoon.gzipdecompressor"
vscode "kelvin.vscode-sshfs"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "timonwong.shellcheck"
